chat_system_17695350_actor_description=High Shaman Bahalum. Orc-shaman.
chat_system_17695350_snap_0_question=^?^When Endoria have to die, Titan take her power and power of all living creatures which die too. Seth becomes very powerful, almost like gods. Why he care about our world, if he can create his own?<br>Orcs don't want to die. We try to make wait, not kidnap the girl, think how to survive! Shamans smoke and pick mushroom, think a lot. And they have thought to build big flying ship, to fly on it to another world! Archaplane!
chat_system_17695350_snap_0_answer_0=^?^Yeah, the machine impressed me. I didn't think that orcs are capable of creating THIS!
chat_system_17695350_snap_9_question=^?^We could not do Archaplane by ourselves. We go to dwarves ask for engineers. We can't say truth, so we say that we want to build tunnel.<br>But dwarves laugh and don't give us engineer! And then we take all engineers by force and take drafts and run. Dwarf warriors pursue us. And then Seth's voice orders: "Open portal!" Orcs open - and terrible demon goes out. Orcs are afraid and run faster, barely get on the ship. So we get engineers.
chat_system_17695350_snap_9_answer_0=^?^So, to build the Archaplane you stole engineers from the dwarves?
chat_system_17695350_snap_1_question=^?^Yes, dwarves' engineers work for us now. They made big draft and say that ship must be built from magic tree.<br>In Murock no tree, there nothing, bad land. We send an ambassador to elves. Ask for Tree.
chat_system_17695350_snap_1_answer_0=^?^I know. Queen Violetta didn't give you the wood, and kicked your ambassadors out.
chat_system_17695350_snap_2_question=^?^Right! You know, you is shaman-human?!!<br>Elves not to listen to our ambassadors and stick into him many many arrows. And then we find evil witch Zelberra, who not like elves very very much. She teach us, how to get the wood: resurrect murderer Karador with help of Crystal of Darkness! Big army of undead creatures go with Karador and kill elves. And then we cut-saw magic forest.
chat_system_17695350_snap_2_answer_0=^?^Well, it's a good idea. But aren't you afraid of Karador?
chat_system_17695350_snap_10_question=^?^Yes! We are very afraid of the Karador! Very much afraid. But more than Karador we are afraid of Haas, who is angry and his head is sick. He tired of waiting for girl, and eat up High Chieftain. Then he eat up Younger High Chieftain, then he eat up most Younger chieftain. We many chieftains have, so, until Haas eat up all of them, we have time to resurrect Karador and cut elf wood.<br>Karador be thankful for us, he order elves to kidnap little girl, who is child of gods and of humans' Great Chieftain.
chat_system_17695350_snap_10_answer_0=^?^So you confess to kidnapping Princess Amelie from King Mark. Where is she now?
